PROC 1 MOL PSIOWN(#ZA0BF9.) LDPRFX(PSI.)
CONTROL MSG LIST NOF
  ALLOC DS(&MOL..FILE6) DD(FT06F001) TR SP(1,1) RENEW REUSE
  ALLOC DS(&MOL..FILE11) DD(FT11F001) OLD REUSE
  ALLOC DS(&MOL..BMAT) DD(FT40F001) OLD REUSE
  EX &PSIOWN.PSI.CLIST:PSILDGO '&PSIOWN,&PSIOWN.PSI.PSIMAIN.OBJ,+
                  &LDPRFX.BMWRTA,+
                  &LDPRFX.LIB'
  SET &BMWRTACC = &LASTCC
  WRITE &&BMWRTACC = &BMWRTACC
EXIT CODE(&BMWRTACC)
