PROC 1 MOL
CONTROL MSG LIST NOF
 
/* THIS COMPLETES THE DIRECT ACCESS FILE ALLOCATION PROCESS
 
OPENFILE MAXRECDD,OUTPUT
SET &MAXRECDD = &STR( 0 0)
PUTFILE MAXRECDD
CLOSFILE MAXRECDD
CONTROL NOMSG NOLIST NOF
CO @.&MOL..MAXRECT @.&MOL..MAXREC ADD
CONTROL MSG LIST NOF
ALLOC DS(@.&MOL..MAXREC) DD(FT28F001) REUSE
 
EXIT CODE(0)
